app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`standard` IS NULL
---
	def index
		if current_user.present?
			if current_user.paid_videos_validity >= Date.today
				@videos = Video.where(standard:params["standard"])

SELECT `videos`.* FROM `videos`
---
	def showAll
		if admin==true
			@videos = Video.all

INSERT INTO `videos` (`title`, `link`, `description`, `created_at`, `updated_at`) VALUES ('title1', '<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/DHvZLI7Db8E\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>', 'description1', '2020-05-16 14:02:45', '2020-05-16 14:02:45')
---
	def create
		if admin==true
			@newVideo = Video.create(video_params)

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 18 LIMIT 1
DELETE FROM `videos` WHERE `videos`.`id` = 18
---
	def destroy
		if admin==true
			@video = Video.find_by(id: params[:id])
			@video.destroy

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 13 LIMIT 1
---
	def edit
		if admin==true
			@video = Video.find_by(id: params[:id])

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 16 LIMIT 1
UPDATE `videos` SET `description` = 'description06', `link` = 'test link01', `updated_at` = '2020-05-17 07:47:08' WHERE `videos`.`id` = 18
---
	def update
		if admin==true
			@video = Video.find_by(id: params[:video][:id])
			@video.update(video_params)